tapmo-invoice/app/Models/SiteModel.php

	function get_app_key($keyType){
		// $types = ['public_key', 'secret_key'];
		return $this->setting
		            ->select("value")
		            ->where("key",$keyType)
					->get()
					->getRow()->value;
---
SELECT `value`
FROM `setting`
WHERE `key` = 'public_key'